-- phpMyAdmin SQL Dump
-- version 5.2.1
-- https://www.phpmyadmin.net/
--
-- Εξυπηρετητής: 127.0.0.1
-- Χρόνος δημιουργίας: 04 Μάη 2026 στις 15:20:24
-- Έκδοση διακομιστή: 10.4.32-MariaDB
-- Έκδοση PHP: 8.2.12

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Βάση δεδομένων: `snor_db`
--

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `comments`
--

CREATE TABLE `comments` (
  `id` int(11) NOT NULL,
  `recipe_id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `comment_text` text NOT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `comments`
--

INSERT INTO `comments` (`id`, `recipe_id`, `user_id`, `comment_text`, `created_at`) VALUES
(4, 4, 2, 'Excellent!', '2026-04-21 19:41:42'),
(5, 4, 3, 'Perfect!', '2026-04-21 19:43:30');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `likes`
--

CREATE TABLE `likes` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `recipe_id` int(11) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `likes`
--

INSERT INTO `likes` (`id`, `user_id`, `recipe_id`) VALUES
(47, 2, 4),
(50, 2, 7),
(38, 3, 4);

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `recipes`
--

CREATE TABLE `recipes` (
  `id` int(11) NOT NULL,
  `user_id` int(11) NOT NULL,
  `title` varchar(255) NOT NULL,
  `description` text NOT NULL,
  `image_url` varchar(255) DEFAULT NULL,
  `created_at` timestamp NOT NULL DEFAULT current_timestamp()
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `recipes`
--

INSERT INTO `recipes` (`id`, `user_id`, `title`, `description`, `image_url`, `created_at`) VALUES
(4, 2, 'Παστιτσιο', 'ΥΛΙΚΑ:\n750 γρ. μοσχαρίσιο κιμά\r\n2 κρεμμύδια\r\n1 σκ. σκόρδο\r\n1 κ.γ. θυμάρι, φρέσκο\r\n4 κ.σ. ελαιόλαδο\r\n1 κ.σ. κρυσταλλική ζάχαρη\r\n2 κ.σ. πελτέ ντομάτας\r\n100 ml κόκκινο κρασί\r\n400 γρ. ντομάτα κονκασέ\r\n1 κ.γ. κανέλα\r\n2 κύβους βοδινού\r\n2 φύλλα δάφνης\r\n1/2 ματσάκι μαϊντανό, ψιλοκομμένο\r\n\r\nΓια την μπεσαμέλ\r\n\r\n100 γρ. βούτυρο\r\n100 γρ. αλεύρι γ.ό.χ.\r\n1 λίτρο γάλα πλήρες\r\nαλάτι\r\nπιπέρι\r\n1/2 κ.γ. τριμμένο μοσχοκάρυδο\r\n100 γρ. γραβιέρα, τριμμένη\r\n3 κρόκους, από μεσαία αυγά\r\n\r\nΓια τα μακαρόνια\r\n\r\n300 γρ. μακαρόνια για παστίτσιο\r\n30 ml ελαιόλαδο,\r\n1/2 ματσάκι μαϊντανό,\r\n1/2 ματσάκι θυμάρι\r\n2 αυγά, μεσαία\r\n200 γρ. φέτα\r\n\r\nΓια τη σύνθεση\r\n\r\n50 γρ. γραβιέρα, τριμμένη\n\nΕΚΤΕΛΕΣΗ:\nΓια τον κιμά\r\n\r\nΨιλοκόβουμε τα κρεμμύδια, το σκόρδο και το θυμάρι.\r\nΤοποθετούμε μια κατσαρόλα σε δυνατή φωτιά, ρίχνουμε 2 κ.σ. ελαιόλαδο, τα κρεμμύδια, το σκόρδο, το θυμάρι και τη ζάχαρη, και σοτάρουμε για 3-4 λεπτά, μέχρι να καραμελώσουν.\r\nΠροσθέτουμε τον πελτέ ντομάτας και σοτάρουμε για ακόμα 2 λεπτά.\r\nΠροσθέτουμε τον κιμά και τον σπάμε με μια κουτάλα.\r\nΣοτάρουμε για 4-5 λεπτά μέχρι να πάρει χρώμα. Αν χρειαστεί, προσθέτουμε ακόμα 2 κ.σ. ελαιόλαδο.\r\nΣβήνουμε με το κρασί και αφήνουμε να εξατμιστεί τελείως το αλκοόλ του.\r\nΠροσθέτουμε την ντομάτα κονκασέ, την κανέλα, τους κύβους και τα φύλλα δάφνης. \r\nΜαγειρεύουμε σε χαμηλή φωτιά για 10-20 λεπτά μέχρι να πιει όλα τα υγρά του το φαγητό.\r\nΑποσύρουμε την κατσαρόλα από τη φωτιά και αφαιρούμε τα φύλλα δάφνης. \r\nΠροσθέτουμε τον μαϊντανό, ανακατεύουμε, και αφήνουμε στην άκρη.\r\n\r\nΓια την μπεσαμέλ\r\n\r\nΤοποθετούμε μια κατσαρόλα σε μέτρια φωτιά, ρίχνουμε το βούτυρο και αφήνουμε να λιώσει.\r\nΠροσθέτουμε 100 γρ. αλεύρι και ανακατεύουμε καλά με ένα σύρμα χειρός για μερικά λεπτά μέχρι να καβουρδιστεί. Προσέχουμε να παίρνουμε και από τα πλάγια της κατσαρόλας το αλεύρι για να μην καεί.\r\nΠροσθέτουμε σε αρκετές δόσεις το γάλα, ανακατεύοντας συνεχώς με το σύρμα χειρός.\r\nΜόλις βγάλει τις πρώτες φουσκάλες, αποσύρουμε την κατσαρόλα από τη φωτιά.\r\nΠροσθέτουμε το αλάτι, το πιπέρι, το μοσχοκάρυδο και την τριμμένη γραβιέρα, και ανακατεύουμε με το σύρμα χειρός για να πέσει η θερμοκρασία. \r\nΠροσθέτουμε τους κρόκους και ανακατεύουμε ξανά μέχρι να ομογενοποιηθούν τα υλικά.\r\n\r\nΓια τα ζυμαρικά\r\n\r\nΤοποθετούμε μια κατσαρόλα σε δυνατή φωτιά, ρίχνουμε νερό και αλάτι και αφήνουμε να πάρει βράση.\r\nΡίχνουμε τα ζυμαρικά και βράζουμε 2 λεπτά λιγότερο από τις οδηγίες της συσκευασίας.\r\nΑποσύρουμε την κατσαρόλα από τη φωτιά, σουρώνουμε τα ζυμαρικά και τα μεταφέρουμε ξανά στην κατσαρόλα.\r\nΡίχνουμε το ελαιόλαδο, ανακατεύουμε και μεταφέρουμε τα ζυμαρικά σε ένα ορθογώνιο ταψί διαστάσεων 25x35 εκ.\r\nΨιλοκόβουμε το θυμάρι και τον μαϊντανό και τα ρίχνουμε στο ταψί.\r\nΠροσθέτουμε τα αυγά και τη φέτα και ανακατεύουμε καλά με τα χέρια μας.\r\n\r\nΓια το παστίτσιο\r\n\r\nΠροθερμαίνουμε τον φούρνο στους 180°C στον αέρα.\r\nΡίχνουμε στον κιμά 1 μεγάλη κουταλιά μπεσαμέλ με την κουτάλα της σούπας και ανακατεύουμε καλά για να δέσει. \r\nΡίχνουμε τον κιμά πάνω από τα μακαρόνια και τον απλώνουμε καλά με ένα κουτάλι. \r\nΡίχνουμε από πάνω την μπεσαμέλ, την απλώνουμε καλά και πασπαλίζουμε με την τριμμένη γραβιέρα.\r\nΜεταφέρουμε το ταψί στον φούρνο και ψήνουμε για 40 λεπτά ή μέχρι να πάρει χρυσαφένιο χρώμα η μπεσαμέλ.\r\nΑφαιρούμε το ταψί από τον φούρνο και αφήνουμε στην άκρη να κρυώσει και να σταθεροποιηθεί για 30 λεπτά.\r\nΚόβουμε σε κομμάτια και σερβίρουμε.', '1776800457_Pastitsio.jpg', '2026-04-21 19:40:57'),
(7, 2, 'Γαριδομακαρονάδα', 'ΥΛΙΚΑ:\n250 γρ. λιγκουίνι\r\n1/2 κιλό γαρίδες, Νο 2 κατεψυγμένες\r\n1 κύβο λαχανικών\r\n750 ml νερό\r\n1 κρεμμύδι\r\n50 ml ελαιόλαδο\r\n1/2 κ.γ. κρυσταλλική ζάχαρη\r\n1 πρέζα μπούκοβο\r\n1 σκ. σκόρδο, ψιλοκομμένη\r\n30 ml ούζο\r\n2 ντομάτες, ώριμες\r\n50 γρ. βούτυρο, ή μαργαρίνη\r\n4-5 φύλλα βασιλικού, ψιλοκομμένα\r\n1 φρέσκο κρεμμυδάκι, ψιλοκομμένο\r\nξύσμα λεμονιού, από 1 λεμόνι\r\n50 γρ. παρμεζάνα, τριμμένη\r\nαλάτι\r\nπιπέρι\r\n\r\nΓια το σερβίρισμα\r\n\r\nελαιόλαδο\r\nπιπέρι\r\nπαρμεζάνα, τριμμένη\r\nφύλλα βασιλικού\n\nΕΚΤΕΛΕΣΗ:\nΑποψύχουμε τις γαρίδες και τις καθαρίζουμε αφαιρώντας το κεφάλι και το κέλυφος και αφήνοντας την ουρά για ομορφιά. (Τα κεφάλια και τα κελύφη τα αφήνουμε στην άκρη.)\r\nΜε τη βοήθεια ενός μικρού μαχαιριού χαράζουμε τη ράχη της γαρίδας (το πίσω μέρος) από την ουρά προς το κεφάλι για να αφαιρέσουμε το έντερο, όχι όμως πολύ. Ίσα-ίσα να βλέπουμε το έντερο και να μπορούμε να το αφαιρέσουμε.\r\nΒάζουμε τα κεφάλια και τα κελύφη από τις γαρίδες σε μια κατσαρόλα μαζί με τον κύβο λαχανικών και το νερό.\r\nΤοποθετούμε στη φωτιά, καπακώνουμε και αφήνουμε να πάρει βράση.\r\nΣιγοβράζουμε για 15 λεπτά. (Δεν βράζουμε πάνω από 15 λεπτά γιατί θα πικρίσει ο ζωμός.)\r\nΑποσύρουμε από τη φωτιά, σουρώνουμε σε ένα μπολ τον ζωμό και τον αφήνουμε στην άκρη.\r\nΡαντίζουμε τις γαρίδες με ελαιόλαδο, αλάτι και πιπέρι.\r\nΤοποθετούμε ένα βαθύ τηγάνι σε δυνατή φωτιά και αφήνουμε να ζεσταθεί.\r\nΣοτάρουμε τις γαρίδες μέχρι να πάρουν χρώμα και από τις 2 πλευρές για περίπου 1/2 λεπτό την κάθε πλευρά.\r\nΑφαιρούμε τις γαρίδες από το τηγάνι, τις βάζουμε σε ένα πιάτο και τις αφήνουμε στην άκρη.\r\nΒάζουμε το τηγάνι πίσω σε δυνατή φωτιά.\r\nΧοντροκόβουμε το κρεμμύδι και το ρίχνουμε στο τηγάνι.\r\nΡίχνουμε μέσα το ελαιόλαδο, τη ζάχαρη και το μπούκοβο.\r\nΨιλοκόβουμε το σκόρδο, το ρίχνουμε και αυτό, και συνεχίζουμε το σοτάρισμα για λίγα δευτερόλεπτα.\r\nΣβήνουμε με το ούζο και αφήνουμε να εξατμιστεί τελείως το αλκοόλ του.\r\nΚόβουμε τις ντομάτες και τις ρίχνουμε στο τηγάνι.\r\nΡίχνουμε τον ζωμό από τις γαρίδες και τα ζυμαρικά.\r\nΑνακατεύουμε και χαμηλώνουμε τη φωτιά σε μέτρια.\r\nΣιγοβράζουμε για 10 λεπτά ανακατεύοντας συχνά, και όταν δούμε ότι η σάλτσα έχει δέσει αλλά υπάρχει ακόμα λίγη υγρασία, ρίχνουμε μέσα το βούτυρο ή τη μαργαρίνη -αν θέλουμε η συνταγή να γίνει νηστίσιμη- και ανακατεύουμε μέχρι να δέσει η σάλτσα. \r\nΑποσύρουμε το τηγάνι από τη φωτιά, προσθέτουμε μέσα τις γαρίδες και τα φύλλα βασιλικού.\r\nΡίχνουμε το ψιλοκομμένο φρέσκο κρεμμυδάκι, το ξύσμα λεμονιού και προαιρετικά την παρμεζάνα.\r\nΣερβίρουμε με λίγο ελαιόλαδο, φρέσκο πιπέρι, τριμμένη παρμεζάνα και φύλλα βασιλικού.', '1776870386_γαριδομακαρονάδα.webp', '2026-04-22 15:06:26');

-- --------------------------------------------------------

--
-- Δομή πίνακα για τον πίνακα `users`
--

CREATE TABLE `users` (
  `id` int(11) NOT NULL,
  `username` varchar(100) NOT NULL,
  `email` varchar(100) NOT NULL,
  `password` varchar(255) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4 COLLATE=utf8mb4_general_ci;

--
-- Άδειασμα δεδομένων του πίνακα `users`
--

INSERT INTO `users` (`id`, `username`, `email`, `password`) VALUES
(2, 'Admin', 'admin@gmail.com', '$2y$10$iJCMxHWs9EhKFwQIp8zZKeqtGyEYPwPtExI1wJsoZp6/uXlzDe4OG'),
(3, 'TestUser', 'testuser@gmail.com', '$2y$10$4l.mIRx415KODi2kaD6FzOAbQb4b4hnDplxs1TlMPfFOoHK3z.kuK');

--
-- Ευρετήρια για άχρηστους πίνακες
--

--
-- Ευρετήρια για πίνακα `comments`
--
ALTER TABLE `comments`
  ADD PRIMARY KEY (`id`),
  ADD KEY `recipe_id` (`recipe_id`),
  ADD KEY `user_id` (`user_id`);

--
-- Ευρετήρια για πίνακα `likes`
--
ALTER TABLE `likes`
  ADD PRIMARY KEY (`id`),
  ADD UNIQUE KEY `unique_like` (`user_id`,`recipe_id`),
  ADD KEY `recipe_id` (`recipe_id`);

--
-- Ευρετήρια για πίνακα `recipes`
--
ALTER TABLE `recipes`
  ADD PRIMARY KEY (`id`),
  ADD KEY `fk_user_recipe` (`user_id`);

--
-- Ευρετήρια για πίνακα `users`
--
ALTER TABLE `users`
  ADD PRIMARY KEY (`id`);

--
-- AUTO_INCREMENT για άχρηστους πίνακες
--

--
-- AUTO_INCREMENT για πίνακα `comments`
--
ALTER TABLE `comments`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=6;

--
-- AUTO_INCREMENT για πίνακα `likes`
--
ALTER TABLE `likes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=51;

--
-- AUTO_INCREMENT για πίνακα `recipes`
--
ALTER TABLE `recipes`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=8;

--
-- AUTO_INCREMENT για πίνακα `users`
--
ALTER TABLE `users`
  MODIFY `id` int(11) NOT NULL AUTO_INCREMENT, AUTO_INCREMENT=4;

--
-- Περιορισμοί για άχρηστους πίνακες
--

--
-- Περιορισμοί για πίνακα `comments`
--
ALTER TABLE `comments`
  ADD CONSTRAINT `comments_ibfk_1` FOREIGN KEY (`recipe_id`) REFERENCES `recipes` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `comments_ibfk_2` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE;

--
-- Περιορισμοί για πίνακα `likes`
--
ALTER TABLE `likes`
  ADD CONSTRAINT `likes_ibfk_1` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE,
  ADD CONSTRAINT `likes_ibfk_2` FOREIGN KEY (`recipe_id`) REFERENCES `recipes` (`id`) ON DELETE CASCADE;

--
-- Περιορισμοί για πίνακα `recipes`
--
ALTER TABLE `recipes`
  ADD CONSTRAINT `fk_user_recipe` FOREIGN KEY (`user_id`) REFERENCES `users` (`id`) ON DELETE CASCADE ON UPDATE CASCADE;
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
